app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("cname", "created_at", "desc", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["cname", "Test"], ["created_at", Wed, 19 Sep 2012 17:48:14 UTC +00:00], ["desc", "Test"], ["updated_at", Wed, 19 Sep 2012 17:48:14 UTC +00:00], ["user_id", 1]]