app/controllers/events_controller.rb

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("category_id", "created_at", "desc", "ename", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["created_at", Mon, 17 Sep 2012 21:18:11 UTC +00:00], ["desc", ""], ["ename", "Software Engineering"], ["updated_at", Mon, 17 Sep 2012 21:18:11 UTC +00:00]]