app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs" WHERE ( Log.event.ename LIKE '%4%')
SELECT "logs".* FROM "logs" ORDER BY date LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "logs"
---
  def index
    search_logs = Log.search(params[:search])
    @logs = search_logs.paginate :page=>params[:page],:per_page => 5

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @log = Log.find(params[:id])

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @log = Log.find(params[:id])

INSERT INTO "logs" ("created_at", "date", "event_id", "hours", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @log = Log.new(params[:log])

    respond_to do |format|
      if @log.save

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "7"]]
DELETE FROM "logs" WHERE "logs"."id" = ?  [["id", 7]]
---
  def destroy
    @log = Log.find(params[:id])
    @log.destroy