app/views/categories/show.html.erb

  <% id = @category.id %>
  <% @values = Event.find_all_by_category_id (id) %>
---
SELECT "events".* FROM "events" WHERE "events"."category_id" = 1 LIMIT 1