app/views/logs/index.html.erb


            series:[
                    <% @logs.each do |log| %>
                    {
                        name: "<%= log.event.ename %>",
                        bla: "<%= log.date %>",
                        data: [<%= log.hours %>]
                    },
                    <% end %>
                    ]
---
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1